{"name": "Dataset | ROIS-DS Center for Open Data in the Humanities", "description": "We provide three types of datasets, namely Kuzushiji-MNIST、Kuzushiji-49、Kuzushiji-Kanji, for different purposes. Pre-Modern Japanese Text, owned by National Institute of Japanese Literature, consists of image and text data and was released as open data. Some books also have summary, transcription, and tagging data. Cooking books in the Edo period, provided from Dataset of Pre-Modern Japanese Text, were curated for creating recipe datasets through the process of transcription, translation to modern Japanese, and structuring into the recipe format. As a by-product of transcription for the Dataset of Pre-Modern Japanese Text (PMJT), shapes and coordinates of old Japanese characters (Kuzushiji) were compiled to create another dataset for training to make machines and humans smarter. Adapted from Kuzushiji Dataset, KMNIST dataset is a drop-in replacement for MNIST dataset. We provide three types of datasets, namely Kuzushiji-MNIST、Kuzushiji-49、Kuzushiji-Kanji, for different purposes. Seal Script Dataset is a machine learning-friendly dataset of 'Tensho' character images cropped from old dictionaries of characters from Japan and China to be used for the interpretation of seals.... Based on the results of digitization of magazines published in the early to mid-Meiji period (modern magazines), we release machine learning datasets for OCR and develop OCR software (Kindai-OCR).", "owner_name": "ROIS-DS Center for Open Data in the Humanities", "owner_website": "https://codh.rois.ac.jp/index.html.en", "owner_type": "Academy", "owner_country_iso2": "JP", "owner_country": "Japan", "owner_subregion_iso3166_2": "JPN", "owner_subregion_name": "Japan", "data_themes": ["education", "culture", "science and technology"], "geotopics": [], "tags": ["Kuzushiji-MNIST", "Kuzushiji-49", "Kuzushiji-Kanji", "Seal Script", "Pre-modern Japanese text", "OCR", "Machine Learning", "Text data", "Image data"], "uid": "cdi00001022", "id": "codhroisacjp"}